Repository: nadaatef15/Hospital_Management_System-HMS-
Catalog: HMSContracts/Language/Resource.*.resx
Languages: ar

# appointmentDoesnotExist
source: The appointment does not exist
ar: هذا المعاد غير موجود

# DochasScheduleInThisDate
source: The Doctor has already Schedule in the same Date
ar: الطبيب لديه جدول ف هذا التاريخ

# EmailNotFound
source: This Email does not exist
ar: هذا البريد الإلكتروني غير موجود

# EmailUsedBefore
source: This Email is used before
ar: تم استخدام هذا البريد الإلكتروني من قبل

# invalidAppointment
source: This Appointment is used in MedicalRecord You can not delete it
ar: هذا المعاد مستخدم في تقرير طبي لا يمكنك حذفه

# MedicalRecordDoesnotExist
source: The medicalRecord does not exist
ar: هذا التقرير الطبي غير موجود

# MRDeleted
source: This Medical Record is deleted
ar: هذا التقرير الطبي محذوف

# MustUpload
source: You must upload a file or provide an image path.
ar: يجب عليك تحميل ملف أو توفير مسار الصورة.

# NotTheSameId
source: The id is not the same
ar: ليس نفس الرقم التعريفي

# NoUsers
source: There are no users
ar: ليس هناك مستخدمين

source: patient does not has this appointment
ar: المريض لا يمتلك هذا المعاد

# pharmDoesnotExist
source: The pharmacist does not exist
ar: الصيدلي غير موجود

source: Role Doctor Does Not Exist
ar: دور الطبيب غير موجود

# RoleDoesnotExist
source: This role doesn't exist
ar: هذا الدور غير موجود

# RoleIsExist
source: The role is already exist
ar: الدور موجود بالفعل

# RoleLabTechDoesNotExist
source: Role LabTechnician Does Not Exist
ar: دور طبيب المختبر عير موجود

source: Role Patient Does Not Exist
ar: دور المريض غير موجود

source: Role Pharmacist Does Not Exist
ar: دور الصيديلي غير موجود

source: Role Receptionist Does Not Exist
ar: دور الريسيبشن غير موجود

# ScheduleIsNotExist
source: This Schedule is not Exist
ar: هذا الجدول غير موجود

# UsedBefore
source: The UserName or Email is used before
ar: اسم المستخدم او الايميل الخاص به ليس موجود

# UseDoesnotExist
source: This user doesn't exist
ar: هذا المستخدم غير موجود

# UserNameUsedBefore
source: This user name is used before
ar: تم استخدام اسم المستخدم هذا من قبل

# ValidUrl
source: The provided image path must be a valid URL.
ar: يجب أن يكون مسار الصورة المقدم عنوان URL صالحًا.The provided image path must be a valid URL.

# WrongPassword
source: The password is not Correct
ar: كلمة المرور غير صحيحة

# DocHasSpecialty
source: Doctor Already has this Specialty
ar: هذا الطبيب لديه هذا التخصص

# NameIsNotCorrect
source: Enter a name for Specialty
ar: ادخل اسم التخصص

# NoSpecialtyForDoctor
source: There is no Specialties for the Doctor
ar: لا يوجد تخصص لهذا الطبيب

# SpecialityIsExist
source: This Speciality is Exist
ar: هذا التخصص موجود

# SpecialityIsNotExist
source: this Speciality Is Not Exist
ar: هذا التخصص غير موجود

# IsNotADoctor
source: This User is not a Doctor
ar: هذا المستخدم ليس طبيب

# IsNotAPatient
source: this user is not a patient
ar: هذا المستخدم ليس مريض
